zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxLmu_reg.h
/**
 * \file IfxLmu_reg.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC39XB_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Lmu_Registers_Cfg Lmu address
 * \ingroup IfxSfr_Lmu_Registers
 * 
 * \defgroup IfxSfr_Lmu_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Lmu_Registers_Cfg
 *
 * \defgroup IfxSfr_Lmu_Registers_Cfg_Lmu0 2-LMU0
 * \ingroup IfxSfr_Lmu_Registers_Cfg
 *
 * \defgroup IfxSfr_Lmu_Registers_Cfg_Lmu1 2-LMU1
 * \ingroup IfxSfr_Lmu_Registers_Cfg
 *
 * \defgroup IfxSfr_Lmu_Registers_Cfg_Lmu2 2-LMU2
 * \ingroup IfxSfr_Lmu_Registers_Cfg
 *
 *
 */
#ifndef IFXLMU_REG_H
#define IFXLMU_REG_H 1
/******************************************************************************/
#include "IfxLmu_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Lmu_Registers_Cfg_BaseAddress
 * \{  */

/** \brief LMU object */
#define MODULE_LMU0 /*lint --e(923, 9078)*/ ((*(Ifx_LMU*)0xF8100000u))
#define MODULE_LMU1 /*lint --e(923, 9078)*/ ((*(Ifx_LMU*)0xF8110000u))
#define MODULE_LMU2 /*lint --e(923, 9078)*/ ((*(Ifx_LMU*)0xF8120000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Lmu_Registers_Cfg_Lmu0
 * \{  */
/** \brief 0, LMU Clock Control Register */
#define LMU0_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_CLC*)0xF8100000u)

/** \brief 8, LMU Module ID Register */
#define LMU0_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_MODID*)0xF8100008u)

/** \brief 10, LMU Access Enable Register 0 */
#define LMU0_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_ACCEN0*)0xF8100010u)

/** \brief 14, LMU Access Enable Register 1 */
#define LMU0_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_ACCEN1*)0xF8100014u)

/** \brief 20, LMU Memory Control Register */
#define LMU0_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_MEMCON*)0xF8100020u)

/** \brief 24, LMU Safety Control Register */
#define LMU0_SCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_SCTRL*)0xF8100024u)

/** \brief 50, LMU Region Lower Address Register */
#define LMU0_RGN0_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100050u)
/** Alias (User Manual Name) for LMU0_RGN0_LA.
* To use register names with standard convension, please use LMU0_RGN0_LA.
*/
#define LMU0_RGNLA0 (LMU0_RGN0_LA)

/** \brief 54, LMU Region Upper Address Register */
#define LMU0_RGN0_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100054u)
/** Alias (User Manual Name) for LMU0_RGN0_UA.
* To use register names with standard convension, please use LMU0_RGN0_UA.
*/
#define LMU0_RGNUA0 (LMU0_RGN0_UA)

/** \brief 58, LMU Region Write Access Enable Register A */
#define LMU0_RGN0_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100058u)
/** Alias (User Manual Name) for LMU0_RGN0_ACCENA.
* To use register names with standard convension, please use LMU0_RGN0_ACCENA.
*/
#define LMU0_RGNACCENWA0 (LMU0_RGN0_ACCENA)

/** \brief 5C, LMU Region Write Access Enable Register B */
#define LMU0_RGN0_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810005Cu)
/** Alias (User Manual Name) for LMU0_RGN0_ACCENB.
* To use register names with standard convension, please use LMU0_RGN0_ACCENB.
*/
#define LMU0_RGNACCENWB0 (LMU0_RGN0_ACCENB)

/** \brief 60, LMU Region Lower Address Register */
#define LMU0_RGN1_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100060u)
/** Alias (User Manual Name) for LMU0_RGN1_LA.
* To use register names with standard convension, please use LMU0_RGN1_LA.
*/
#define LMU0_RGNLA1 (LMU0_RGN1_LA)

/** \brief 64, LMU Region Upper Address Register */
#define LMU0_RGN1_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100064u)
/** Alias (User Manual Name) for LMU0_RGN1_UA.
* To use register names with standard convension, please use LMU0_RGN1_UA.
*/
#define LMU0_RGNUA1 (LMU0_RGN1_UA)

/** \brief 68, LMU Region Write Access Enable Register A */
#define LMU0_RGN1_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100068u)
/** Alias (User Manual Name) for LMU0_RGN1_ACCENA.
* To use register names with standard convension, please use LMU0_RGN1_ACCENA.
*/
#define LMU0_RGNACCENWA1 (LMU0_RGN1_ACCENA)

/** \brief 6C, LMU Region Write Access Enable Register B */
#define LMU0_RGN1_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810006Cu)
/** Alias (User Manual Name) for LMU0_RGN1_ACCENB.
* To use register names with standard convension, please use LMU0_RGN1_ACCENB.
*/
#define LMU0_RGNACCENWB1 (LMU0_RGN1_ACCENB)

