zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxLmu_reg.h
/** \brief 100, LMU Region Lower Address Register */
#define LMU2_RGN11_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120100u)
/** Alias (User Manual Name) for LMU2_RGN11_LA.
* To use register names with standard convension, please use LMU2_RGN11_LA.
*/
#define LMU2_RGNLA11 (LMU2_RGN11_LA)

/** \brief 104, LMU Region Upper Address Register */
#define LMU2_RGN11_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120104u)
/** Alias (User Manual Name) for LMU2_RGN11_UA.
* To use register names with standard convension, please use LMU2_RGN11_UA.
*/
#define LMU2_RGNUA11 (LMU2_RGN11_UA)

/** \brief 108, LMU Region Write Access Enable Register A */
#define LMU2_RGN11_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8120108u)
/** Alias (User Manual Name) for LMU2_RGN11_ACCENA.
* To use register names with standard convension, please use LMU2_RGN11_ACCENA.
*/
#define LMU2_RGNACCENWA11 (LMU2_RGN11_ACCENA)

/** \brief 10C, LMU Region Write Access Enable Register B */
#define LMU2_RGN11_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF812010Cu)
/** Alias (User Manual Name) for LMU2_RGN11_ACCENB.
* To use register names with standard convension, please use LMU2_RGN11_ACCENB.
*/
#define LMU2_RGNACCENWB11 (LMU2_RGN11_ACCENB)

/** \brief 110, LMU Region Lower Address Register */
#define LMU2_RGN12_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120110u)
/** Alias (User Manual Name) for LMU2_RGN12_LA.
* To use register names with standard convension, please use LMU2_RGN12_LA.
*/
#define LMU2_RGNLA12 (LMU2_RGN12_LA)

/** \brief 114, LMU Region Upper Address Register */
#define LMU2_RGN12_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120114u)
/** Alias (User Manual Name) for LMU2_RGN12_UA.
* To use register names with standard convension, please use LMU2_RGN12_UA.
*/
#define LMU2_RGNUA12 (LMU2_RGN12_UA)

/** \brief 118, LMU Region Write Access Enable Register A */
#define LMU2_RGN12_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8120118u)
/** Alias (User Manual Name) for LMU2_RGN12_ACCENA.
* To use register names with standard convension, please use LMU2_RGN12_ACCENA.
*/
#define LMU2_RGNACCENWA12 (LMU2_RGN12_ACCENA)

/** \brief 11C, LMU Region Write Access Enable Register B */
#define LMU2_RGN12_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF812011Cu)
/** Alias (User Manual Name) for LMU2_RGN12_ACCENB.
* To use register names with standard convension, please use LMU2_RGN12_ACCENB.
*/
#define LMU2_RGNACCENWB12 (LMU2_RGN12_ACCENB)

/** \brief 120, LMU Region Lower Address Register */
#define LMU2_RGN13_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120120u)
/** Alias (User Manual Name) for LMU2_RGN13_LA.
* To use register names with standard convension, please use LMU2_RGN13_LA.
*/
#define LMU2_RGNLA13 (LMU2_RGN13_LA)

/** \brief 124, LMU Region Upper Address Register */
#define LMU2_RGN13_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120124u)
/** Alias (User Manual Name) for LMU2_RGN13_UA.
* To use register names with standard convension, please use LMU2_RGN13_UA.
*/
#define LMU2_RGNUA13 (LMU2_RGN13_UA)

/** \brief 128, LMU Region Write Access Enable Register A */
#define LMU2_RGN13_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8120128u)
/** Alias (User Manual Name) for LMU2_RGN13_ACCENA.
* To use register names with standard convension, please use LMU2_RGN13_ACCENA.
*/
#define LMU2_RGNACCENWA13 (LMU2_RGN13_ACCENA)

/** \brief 12C, LMU Region Write Access Enable Register B */
#define LMU2_RGN13_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF812012Cu)
/** Alias (User Manual Name) for LMU2_RGN13_ACCENB.
* To use register names with standard convension, please use LMU2_RGN13_ACCENB.
*/
#define LMU2_RGNACCENWB13 (LMU2_RGN13_ACCENB)

/** \brief 130, LMU Region Lower Address Register */
#define LMU2_RGN14_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120130u)
/** Alias (User Manual Name) for LMU2_RGN14_LA.
* To use register names with standard convension, please use LMU2_RGN14_LA.
*/
#define LMU2_RGNLA14 (LMU2_RGN14_LA)

/** \brief 134, LMU Region Upper Address Register */
#define LMU2_RGN14_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120134u)
/** Alias (User Manual Name) for LMU2_RGN14_UA.
* To use register names with standard convension, please use LMU2_RGN14_UA.
*/
#define LMU2_RGNUA14 (LMU2_RGN14_UA)

/** \brief 138, LMU Region Write Access Enable Register A */
#define LMU2_RGN14_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8120138u)
/** Alias (User Manual Name) for LMU2_RGN14_ACCENA.
* To use register names with standard convension, please use LMU2_RGN14_ACCENA.
*/
#define LMU2_RGNACCENWA14 (LMU2_RGN14_ACCENA)

/** \brief 13C, LMU Region Write Access Enable Register B */
#define LMU2_RGN14_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF812013Cu)
/** Alias (User Manual Name) for LMU2_RGN14_ACCENB.
* To use register names with standard convension, please use LMU2_RGN14_ACCENB.
*/
#define LMU2_RGNACCENWB14 (LMU2_RGN14_ACCENB)

/** \brief 140, LMU Region Lower Address Register */
#define LMU2_RGN15_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8120140u)
/** Alias (User Manual Name) for LMU2_RGN15_LA.
* To use register names with standard convension, please use LMU2_RGN15_LA.
*/
#define LMU2_RGNLA15 (LMU2_RGN15_LA)

/** \brief 144, LMU Region Upper Address Register */
#define LMU2_RGN15_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8120144u)
/** Alias (User Manual Name) for LMU2_RGN15_UA.
* To use register names with standard convension, please use LMU2_RGN15_UA.
*/
#define LMU2_RGNUA15 (LMU2_RGN15_UA)

/** \brief 148, LMU Region Write Access Enable Register A */
#define LMU2_RGN15_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8120148u)
/** Alias (User Manual Name) for LMU2_RGN15_ACCENA.
* To use register names with standard convension, please use LMU2_RGN15_ACCENA.
*/
#define LMU2_RGNACCENWA15 (LMU2_RGN15_ACCENA)

